import numpy as np
# Triple rings lined up (xy*500 x+900 y+450 vel*10) m = 500/10
inits0 = np.array([
    -0.0347, 1.1856, 0.2693, -1.0020, -0.2328, -0.5978,
    0.2495, -0.1076, 0.2059, -0.9396, -0.4553, 1.0471
])
# Flower in circle (xy*700 x+900 y+450 vel*10) m = 700/10
inits1 = np.array([
    -0.602885898116520, 1.059162128863347-1, 0.252709795391000,
    1.058254872224370-1, -0.355389016941814, 1.038323764315145-1,
    0.122913546623784, 0.747443868604908, -0.019325586404545,
    1.369241993562101, -0.103587960218793, -2.116685862168820
])
# Classic montgomery 8 (xy*500 x+900 y+450 vel*10) m以此类推
inits2 = np.array([
    -0.97000436, 0.24308753, 0.97000436,
    -0.24308753, 0, 0,
    -0.5 * 0.93240737, -0.5 * 0.86473146, -0.5 * 0.93240737,
    -0.5 * 0.86473146, 0.93240737, 0.86473146
])
# Two ovals (xy*500 x+900 y+450 vel*10)
inits3 = np.array([
    0.486657678894505, 0.755041888583519, -0.681737994414464,
    0.293660233197210, -0.022596327468640, -0.612645601255358,
    -0.182709864466916, 0.363013287999004, -0.579074922540872,
    -0.748157481446087, 0.761784787007641, 0.385144193447218
])
# Oval and crossed triple loop (xy*300 x+900 y+450 vel*10)
inits4 = np.array([ 
    0.654504904492769, 1.135463234751087, -0.008734462769570,
    -1.481635584087405, -0.487782115417060, 0.236845409927442,
    0.294339951803385, -0.605376046698418, 0.038678643994549,
    0.434105189236202, -0.333018595797923, 0.171270857462206
])
# Gear inside larger oval. (xy*700 x+900 y+450 vel*10)
inits5 = np.array([
    0.335476420318203, -0.243208301824394, 0.010021708193205,
    0.363104062311693, 0.030978712523174, 0.423035485079015,
    1.047838171160758, 0.817404215288346, -0.847200907807940,
    -0.235749148338353, -0.200636552532016, -0.581655492859626
])
# 3 ovals diving into the middle
from math import *
inits6 = [1,0, -0.5,sqrt(3)/2, -0.5,-sqrt(3)/2,
         0,0.5, -sqrt(3)/4,-0.25,  sqrt(3)/4,-0.25]
inits6 = np.array(inits6)
# Broucke A 11 (xy*100 x+900 y+450 vel*10) m =10
inits7 = np.array([ 
    0.0132604844, 0.0000000000,   # 初始位置1
    1.4157286016, 0.0000000000,   # 初始位置2
    -1.4289890859, 0.0000000000,  # 初始位置3
    0.0000000000, 1.0541519210,   # 初始速度1
    0.0000000000, -0.2101466639,  # 初始速度2
    0.0000000000, -0.8440052572   # 初始速度3
])


# for i in range(6):#水平竖直翻转
#     inits[i*2] = inits0[2*i + 1]
#     inits[i*2 + 1] = inits0[2 * i]
inits = np.array([ 
    0.0132604844, 0.0000000000,   # 初始位置1
    1.4157286016, 0.0000000000,   # 初始位置2
    -1.4289890859, 0.0000000000,  # 初始位置3
    0.0000000000, 1.0541519210,   # 初始速度1
    0.0000000000, -0.2101466639,  # 初始速度2
    0.0000000000, -0.8440052572   # 初始速度3
])

# 经过下面的处理和在js文件中设置对应质量就完成坐标变换，在这个坐标系运行三体周期解，网址：http://three-body.ipb.ac.rs/
# 先通过运行这个文件产生data.json文件，然后再js里读取
inits[:6] = inits[:6] * 100#倍乘和质量相同就行，平移无所谓
for i in range(3):
    inits[i * 2] = inits[2*i] + 900
for i in range(3):
    inits[i * 2 + 1] = inits[2*i + 1] + 450
 
inits[6:] = inits[6:] * 10

print(inits[:6])
print(inits[6:])

import json
with open('data.json', 'w') as f:
    json.dump(inits.tolist(), f)


## js代码
# // 在 JavaScript 中加载 inits.json 文件，由data.py创建
# fetch('data.json')
#     .then(response => response.json())
#     .then(data => {
#     // 在这里使用加载的数据
#     console.log(data);
#     for(let i = 0; i < 3; i++) {
#         planets[i].pos.x = data[i * 2];
#         planets[i].pos.y = data[i * 2 + 1];
#     }
#     for(let i = 0; i < 3; i++) {
#         planets[i].vel.x = data[i * 2 + 6];
#         planets[i].vel.y = data[i * 2 + 1 + 6];
#         planets[i].mass = 10;
#     }
